# Practical 3B: Pandas 

Upon completion of this session you should be able to:

   - use Python Pandas to manipulate the data and files

---
- Materials in this module include resources collected from various open-source online repositories.
- Jupyter source file can be downloaded from clouddeakin SIT384 > weekly resources or https://github.com/gaoshangdeakin/SIT384-Jupyter
- If you found any issue/bug for this document, please submit an issue at [https://github.com/gaoshangdeakin/SIT384/issues](https://github.com/gaoshangdeakin/SIT384/issues)

# Pandas

Credits: The following are notes taken while working through [Python for Data Analysis](http://www.amazon.com/Python-Data-Analysis-Wrangling-IPython/dp/1449319793) by Wes McKinney

Pandas is an external library. To use it, you need to import it first. There are several ways:
* import pandas
* from pandas import tools
* import pandas as pd

## Table of Content

1. Series
2. DataFrame
3. Reindexing
1. Dropping Entries
1. Indexing, Selecting, Filtering
1. Arithmetic and Data Alignment
1. Function Application and Mapping
1. Sorting and Ranking
1. Axis Indices with Duplicate Values
1. Summarizing and Computing Descriptive Statistics
1. Cleaning Data 
1. Input and Output

In [97]:
#different ways to importing pandas
from pandas import Series, DataFrame
import pandas as pd

import numpy as np

## 1. Series

A Series is a one-dimensional array-like object containing an array of data and an associated array of data labels.  The data can be any NumPy data type and the labels are the Series' index.

Create a Series:

In [98]:
ser_1 = Series([1, 1, 2, -3, -5, 8, 13])
ser_1

0     1
1     1
2     2
3    -3
4    -5
5     8
6    13
dtype: int64

Get the array representation of a Series:

In [99]:
ser_1.values

array([ 1,  1,  2, -3, -5,  8, 13], dtype=int64)

Index objects are immutable and hold the axis labels and metadata such as names and axis names.

Get the index of the Series:

In [100]:
ser_1.index

RangeIndex(start=0, stop=7, step=1)

Create a Series with a custom index:

In [101]:
ser_2 = Series([1, 1, 2, -3, -5], index=['a', 'b', 'c', 'd', 'e'])
ser_2
ser_2.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

Get a value from a Series:

In [102]:
ser_2[4] == ser_2['e']

True

Get a set of values from a Series by passing in a list:

In [103]:
ser_2[['c', 'a', 'b']]

c    2
a    1
b    1
dtype: int64

Get values great than 0:

In [104]:
ser_2[ser_2 > 0]

a    1
b    1
c    2
dtype: int64

Scalar multiply:

In [105]:
ser_2 * 2

a     2
b     2
c     4
d    -6
e   -10
dtype: int64

Apply a numpy math function:

In [106]:
import numpy as np
#The np.exp() is used to calculate the exponential of all elements in the input array
np.exp(ser_2)

a    2.718282
b    2.718282
c    7.389056
d    0.049787
e    0.006738
dtype: float64

A Series is like a fixed-length, ordered dict.  

Create a series by passing in a dict:

In [107]:
dict_1 = {'foo' : 100, 'bar' : 200, 'baz' : 300}
ser_3 = Series(dict_1)
ser_3

foo    100
bar    200
baz    300
dtype: int64

Re-order a Series by passing in an index (indices not found are NaN):

In [108]:
#There is no value for index item 'qux', it will be set with value 'NaN'#
#In addition , Nan is considered as a float, pleasa refer the IEEE 754 (https://en.wikipedia.org/wiki/IEEE_754).
#As a result, the dtype will changed into float64
index = ['foo', 'bar', 'baz', 'qux']
ser_4 = Series(dict_1, index=index)
ser_4

foo    100.0
bar    200.0
baz    300.0
qux      NaN
dtype: float64

Check for NaN with the pandas method:

In [109]:
pd.isnull(ser_4)

foo    False
bar    False
baz    False
qux     True
dtype: bool

Check for NaN with the Series method:

In [110]:
ser_4.isnull()

foo    False
bar    False
baz    False
qux     True
dtype: bool

Series automatically aligns differently indexed data in arithmetic operations:

In [111]:
ser_3
ser_4
ser_3 + ser_4

bar    400.0
baz    600.0
foo    200.0
qux      NaN
dtype: float64

Name a Series:

In [112]:
ser_4.name = 'foobarbazqux'

Name a Series index:

In [113]:
ser_4.index.name = 'label'

In [114]:
ser_4

label
foo    100.0
bar    200.0
baz    300.0
qux      NaN
Name: foobarbazqux, dtype: float64

Rename a Series' index in place:

In [115]:
ser_4.index = ['fo', 'br', 'bz', 'qx']
ser_4

fo    100.0
br    200.0
bz    300.0
qx      NaN
Name: foobarbazqux, dtype: float64

## 2. DataFrame

A DataFrame is a tabular data structure containing an ordered collection of columns.  Each column can have a different type.  DataFrames have both row and column indices and is analogous to a dict of Series.  Row and column operations are treated roughly symmetrically.  Columns returned when indexing a DataFrame are views of the underlying data, not a copy.  To obtain a copy, use the Series' copy method.

Create a DataFrame:

In [116]:
data_1 = {'state' : ['VA', 'VA', 'VA', 'MD', 'MD'],
          'year' : [2012, 2013, 2014, 2014, 2015],
          'pop' : [5.0, 5.1, 5.2, 4.0, 4.1]}
df_1 = DataFrame(data_1)
df_1

  state  year  pop
0    VA  2012  5.0
1    VA  2013  5.1
2    VA  2014  5.2
3    MD  2014  4.0
4    MD  2015  4.1

Create a DataFrame specifying a sequence of columns:

In [117]:
df_2 = DataFrame(data_1, columns=['year', 'state', 'pop'])
df_2

   year state  pop
0  2012    VA  5.0
1  2013    VA  5.1
2  2014    VA  5.2
3  2014    MD  4.0
4  2015    MD  4.1

Like Series, columns that are not present in the data are NaN:

In [6]:
df_3 = DataFrame(data_1, columns=['year', 'state', 'pop', 'unempl'])
df_3

   year state  pop unempl
0  2012    VA  5.0    NaN
1  2013    VA  5.1    NaN
2  2014    VA  5.2    NaN
3  2014    MD  4.0    NaN
4  2015    MD  4.1    NaN

Retrieve a column by key, returning a Series:

In [7]:
df_3['state']

0    VA
1    VA
2    VA
3    MD
4    MD
Name: state, dtype: object

Retrive a column by attribute, returning a Series:

In [8]:
df_3.year

0    2012
1    2013
2    2014
3    2014
4    2015
Name: year, dtype: int64

Retrieve a row by position:
Python has provide three function, ix(), loc(), iloc ()  to select rows and columns in Pandas DataFrames

*   Selecting data by label or by a conditional statment (.loc)
*   Selecting data by row numbers (.iloc) (integer position-based)
*   Selecting in a hybrid approach (.ix) (**now Deprecated in Pandas 0.20.1**)

loc is label-based, which means that you have to specify rows and columns based on their row and column labels. iloc is integer position-based, so you have to specify rows and columns by their integer position values (0-based integer position).

In [11]:
df_test = df_3.loc[:,['year']]
display(df_test)
print(type(df_test))
df_test.values

   year
0  2012
1  2013
2  2014
3  2014
4  2015

<class 'pandas.core.frame.DataFrame'>

array([[2012],
       [2013],
       [2014],
       [2014],
       [2015]], dtype=int64)

In [124]:
display(df_3)
df_3.iloc[:,2]
df_3.loc[1,:]
df_3.iloc[2,:]

   year state  pop unempl
0  2012    VA  5.0    NaN
1  2013    VA  5.1    NaN
2  2014    VA  5.2    NaN
3  2014    MD  4.0    NaN
4  2015    MD  4.1    NaN

year      2014
state       VA
pop        5.2
unempl     NaN
Name: 2, dtype: object

In [27]:
df_3.ix[0]

C:\Users\shang\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

year      2012
state       VA
pop          5
unempl     NaN
Name: 0, dtype: object

Update a column by assignment:

In [28]:
df_3['unempl'] = np.arange(5)
df_3

   year state  pop  unempl
0  2012    VA  5.0       0
1  2013    VA  5.1       1
2  2014    VA  5.2       2
3  2014    MD  4.0       3
4  2015    MD  4.1       4

Assign a Series to a column (note if assigning a list or array, the length must match the DataFrame, unlike a Series):

In [29]:
unempl = Series([6.0, 6.0, 6.1], index=[2, 3, 4])
df_3['unempl'] = unempl
df_3

   year state  pop  unempl
0  2012    VA  5.0     NaN
1  2013    VA  5.1     NaN
2  2014    VA  5.2     6.0
3  2014    MD  4.0     6.0
4  2015    MD  4.1     6.1

Assign a new column that doesn't exist to create a new column:

In [30]:
df_3['state_dup'] = df_3['state']
df_3

   year state  pop  unempl state_dup
0  2012    VA  5.0     NaN        VA
1  2013    VA  5.1     NaN        VA
2  2014    VA  5.2     6.0        VA
3  2014    MD  4.0     6.0        MD
4  2015    MD  4.1     6.1        MD

Create a new column based on value of other columns:

In [31]:
df_3['state_dup'] = df_3['state'] + " USA"
df_3

   year state  pop  unempl state_dup
0  2012    VA  5.0     NaN    VA USA
1  2013    VA  5.1     NaN    VA USA
2  2014    VA  5.2     6.0    VA USA
3  2014    MD  4.0     6.0    MD USA
4  2015    MD  4.1     6.1    MD USA

Delete a column:

In [32]:
del df_3['state_dup']
df_3

   year state  pop  unempl
0  2012    VA  5.0     NaN
1  2013    VA  5.1     NaN
2  2014    VA  5.2     6.0
3  2014    MD  4.0     6.0
4  2015    MD  4.1     6.1

Create a DataFrame from a nested dict of dicts (the keys in the inner dicts are unioned and sorted to form the index in the result, unless an explicit index is specified):

In [33]:
pop = {'VA' : {2013 : 5.1, 2014 : 5.2},
       'MD' : {2014 : 4.0, 2015 : 4.1}}
df_4 = DataFrame(pop)
df_4

       VA   MD
2013  5.1  NaN
2014  5.2  4.0
2015  NaN  4.1

Transpose the DataFrame:

In [34]:
df_4.T

    2013  2014  2015
VA   5.1   5.2   NaN
MD   NaN   4.0   4.1

Create a DataFrame from a dict of Series:

In [35]:
data_2 = {'VA' : df_4['VA'][1:],
          'MD' : df_4['MD'][2:]}
df_5 = DataFrame(data_2)
df_5

       VA   MD
2014  5.2  NaN
2015  NaN  4.1

Set the DataFrame index name:

In [36]:
df_5.index.name = 'year'
df_5

       VA   MD
year
2014  5.2  NaN
2015  NaN  4.1

Set the DataFrame columns name:

In [37]:
df_5.columns.name = 'state'
df_5

state   VA   MD
year
2014   5.2  NaN
2015   NaN  4.1

Return the data contained in a DataFrame as a 2D ndarray:

In [38]:
df_5.values

array([[5.2, nan],
       [nan, 4.1]])

If the columns are different dtypes, the 2D ndarray's dtype will accomodate all of the columns:

In [20]:
display(df_3)
df_3.values

   year state  pop unempl
0  2012    VA  5.0    NaN
1  2013    VA  5.1    NaN
2  2014    VA  5.2    NaN
3  2014    MD  4.0    NaN
4  2015    MD  4.1    NaN

array([[2012, 'VA', 5.0, nan],
       [2013, 'VA', 5.1, nan],
       [2014, 'VA', 5.2, nan],
       [2014, 'MD', 4.0, nan],
       [2015, 'MD', 4.1, nan]], dtype=object)

## 3. Reindexing

Create a new object with the data conformed to a new index.  Any missing values are set to NaN.

In [40]:
df_3

   year state  pop  unempl
0  2012    VA  5.0     NaN
1  2013    VA  5.1     NaN
2  2014    VA  5.2     6.0
3  2014    MD  4.0     6.0
4  2015    MD  4.1     6.1

Reindexing rows returns a new frame with the specified index:

In [41]:
df_3.reindex(list(reversed(range(0, 6))))

     year state  pop  unempl
5     NaN   NaN  NaN     NaN
4  2015.0    MD  4.1     6.1
3  2014.0    MD  4.0     6.0
2  2014.0    VA  5.2     6.0
1  2013.0    VA  5.1     NaN
0  2012.0    VA  5.0     NaN

Missing values can be set to something other than NaN:

In [42]:
#for the DataFrame.reindex method
#The parameter of "fill_vaule" is used to replace missing values. 
#Defaults to NaN, but can be any “compatible” value.
df_3.reindex(range(0, 6), fill_value=0)

   year state  pop  unempl
0  2012    VA  5.0     NaN
1  2013    VA  5.1     NaN
2  2014    VA  5.2     6.0
3  2014    MD  4.0     6.0
4  2015    MD  4.1     6.1
5     0     0  0.0     0.0

Interpolate ordered data like a time series:

In [43]:
ser_5 = Series(['foo', 'bar', 'baz'], index=[0, 2, 4])
ser_5

0    foo
2    bar
4    baz
dtype: object

In [44]:
ser_5.reindex(range(5), method='ffill')

0    foo
1    foo
2    bar
3    bar
4    baz
dtype: object

In [45]:
ser_5.reindex(range(5), method='bfill')

0    foo
1    bar
2    bar
3    baz
4    baz
dtype: object

Reindex columns:

In [21]:
display(df_3)
df_3.reindex(columns=['state', 'pop', 'unempl', 'year'])

   year state  pop unempl
0  2012    VA  5.0    NaN
1  2013    VA  5.1    NaN
2  2014    VA  5.2    NaN
3  2014    MD  4.0    NaN
4  2015    MD  4.1    NaN

  state  pop unempl  year
0    VA  5.0    NaN  2012
1    VA  5.1    NaN  2013
2    VA  5.2    NaN  2014
3    MD  4.0    NaN  2014
4    MD  4.1    NaN  2015

Reindex rows and columns while filling rows:

In [47]:
df_3.reindex(index=list(reversed(range(0, 6))),
             fill_value=0,
             columns=['state', 'pop', 'unempl', 'year'])

  state  pop  unempl  year
5     0  0.0     0.0     0
4    MD  4.1     6.1  2015
3    MD  4.0     6.0  2014
2    VA  5.2     6.0  2014
1    VA  5.1     NaN  2013
0    VA  5.0     NaN  2012

## 4. Dropping Entries

Drop rows from a Series or DataFrame:

In [22]:
display(df_3)
df_7 = df_3.drop([0, 1])
df_7

   year state  pop unempl
0  2012    VA  5.0    NaN
1  2013    VA  5.1    NaN
2  2014    VA  5.2    NaN
3  2014    MD  4.0    NaN
4  2015    MD  4.1    NaN

   year state  pop unempl
2  2014    VA  5.2    NaN
3  2014    MD  4.0    NaN
4  2015    MD  4.1    NaN

Drop columns from a DataFrame:

In [49]:
df_7 = df_7.drop('unempl', axis=1)
df_7

   year state  pop
2  2014    VA  5.2
3  2014    MD  4.0
4  2015    MD  4.1

## 5. Indexing, Selecting, Filtering

Series indexing is similar to NumPy array indexing with the added bonus of being able to use the Series' index values.

In [50]:
ser_2

a    1
b    1
c    2
d   -3
e   -5
dtype: int64

Select a value from a Series:

In [51]:
ser_2[0] == ser_2['a']

True

Select a slice from a Series:

In [52]:
ser_2[1:4]

b    1
c    2
d   -3
dtype: int64

Select specific values from a Series:

In [53]:
ser_2[['b', 'c', 'd']]

b    1
c    2
d   -3
dtype: int64

Select from a Series based on a filter:

In [54]:
ser_2[ser_2 > 0]

a    1
b    1
c    2
dtype: int64

Select a slice from a Series with labels (note the end point is inclusive):

In [55]:
ser_2['a':'b']

a    1
b    1
dtype: int64

Assign to a Series slice (note the end point is inclusive):

In [56]:
ser_2['a':'b'] = 0
ser_2

a    0
b    0
c    2
d   -3
e   -5
dtype: int64

Pandas supports indexing into a DataFrame.

In [57]:
df_3

   year state  pop  unempl
0  2012    VA  5.0     NaN
1  2013    VA  5.1     NaN
2  2014    VA  5.2     6.0
3  2014    MD  4.0     6.0
4  2015    MD  4.1     6.1

Select specified columns from a DataFrame:

In [28]:
df_3[['pop', 'unempl']]
#df_3[:,['pop', 'unempl']] #error

   pop unempl
0  5.0    NaN
1  5.1    NaN
2  5.2    NaN
3  4.0    NaN
4  4.1    NaN

Select a slice from a DataFrame:

In [59]:
#df_3[:2]
df_3[1:2]

   year state  pop  unempl
1  2013    VA  5.1     NaN

Select from a DataFrame based on a filter:

In [60]:
df_3[df_3['pop'] > 5]

   year state  pop  unempl
1  2013    VA  5.1     NaN
2  2014    VA  5.2     6.0

Select a slice of rows from a DataFrame (note the end point is inclusive):

In [61]:
df_3.loc[2:3]

#df_3.loc[0:0]
#df_3.loc[1:1].values

   year state  pop  unempl
2  2014    VA  5.2     6.0
3  2014    MD  4.0     6.0

Select a slice of rows from a specific column of a DataFrame:

In [125]:
df_3.loc[0:2, 'pop']
#df_3.iloc[0:2, :] 
#depending iloc or loc. The latter uses index, the former uses position. 
#If it's position, the range is half open [0,2).If index, inclusive.

0    5.0
1    5.1
2    5.2
Name: pop, dtype: float64

Select rows based on an arithmetic operation on a specific column:

In [63]:
display(df_3)
df_3.loc[df_3.unempl > 5.0]

   year state  pop  unempl
0  2012    VA  5.0     NaN
1  2013    VA  5.1     NaN
2  2014    VA  5.2     6.0
3  2014    MD  4.0     6.0
4  2015    MD  4.1     6.1

   year state  pop  unempl
2  2014    VA  5.2     6.0
3  2014    MD  4.0     6.0
4  2015    MD  4.1     6.1

## 6. Arithmetic and Data Alignment

Adding Series objects results in the union of index pairs. If the pairs are not the same, result in NaN for indices that do not overlap:

In [32]:
np.random.seed(0)
ser_6 = Series(np.random.randn(5),
               index=['a', 'b', 'c', 'd', 'e'])
ser_6

a    1.764052
b    0.400157
c    0.978738
d    2.240893
e    1.867558
dtype: float64

In [33]:
np.random.seed(1)
ser_7 = Series(np.random.randn(5),
               index=['a', 'c', 'e', 'f', 'g'])
ser_7

a    1.624345
c   -0.611756
e   -0.528172
f   -1.072969
g    0.865408
dtype: float64

In [34]:
ser_6 + ser_7

a    3.388398
b         NaN
c    0.366982
d         NaN
e    1.339386
f         NaN
g         NaN
dtype: float64

Set a fill value instead of NaN for indices that do not overlap:

In [35]:
ser_6.add(ser_7, fill_value=0)

a    3.388398
b    0.400157
c    0.366982
d    2.240893
e    1.339386
f   -1.072969
g    0.865408
dtype: float64

Adding DataFrame objects results in the union of index pairs for rows and columns. If the pairs are not the same, result in NaN for indices that do not overlap:

In [36]:
np.random.seed(0)
df_8 = DataFrame(np.random.rand(9).reshape((3, 3)),
                 columns=['a', 'b', 'c'])
df_8

          a         b         c
0  0.548814  0.715189  0.602763
1  0.544883  0.423655  0.645894
2  0.437587  0.891773  0.963663

In [37]:
np.random.seed(1)
df_9 = DataFrame(np.random.rand(9).reshape((3, 3)),
                 columns=['b', 'c', 'd'])
df_9

          b         c         d
0  0.417022  0.720324  0.000114
1  0.302333  0.146756  0.092339
2  0.186260  0.345561  0.396767

In [38]:
df_8 + df_9

    a         b         c   d
0 NaN  1.132211  1.323088 NaN
1 NaN  0.725987  0.792650 NaN
2 NaN  1.078033  1.309223 NaN

Set a fill value instead of NaN for indices that do not overlap:

In [39]:
df_10 = df_8.add(df_9, fill_value=0)
df_10

          a         b         c         d
0  0.548814  1.132211  1.323088  0.000114
1  0.544883  0.725987  0.792650  0.092339
2  0.437587  1.078033  1.309223  0.396767

Like NumPy, pandas supports arithmetic operations between DataFrames and Series.

Match the index of the Series on the DataFrame's columns, broadcasting down the rows:

In [90]:
ser_8 = df_10.loc[0]
display(ser_8)
display(df_10)
df_11 = df_10 - ser_8
df_11

a    0.548814
b    1.132211
c    1.323088
d    0.000114
Name: 0, dtype: float64

          a         b         c         d
0  0.548814  1.132211  1.323088  0.000114
1  0.544883  0.725987  0.792650  0.092339
2  0.437587  1.078033  1.309223  0.396767

          a         b         c         d
0  0.000000  0.000000  0.000000  0.000000
1 -0.003930 -0.406224 -0.530438  0.092224
2 -0.111226 -0.054178 -0.013864  0.396653

Match the index of the Series on the DataFrame's columns, broadcasting down the rows and union the indices that do not match:

In [41]:
ser_9 = Series(range(3), index=['a', 'd', 'e'])
ser_9

a    0
d    1
e    2
dtype: int64

In [92]:
display(df_11)
df_11 - ser_9

          a         b         c         d
0  0.000000  0.000000  0.000000  0.000000
1 -0.003930 -0.406224 -0.530438  0.092224
2 -0.111226 -0.054178 -0.013864  0.396653

          a   b   c         d   e
0  0.000000 NaN NaN -1.000000 NaN
1 -0.003930 NaN NaN -0.907776 NaN
2 -0.111226 NaN NaN -0.603347 NaN

Broadcast over the columns and match the rows (axis=0) by using an arithmetic method:

In [43]:
df_10

          a         b         c         d
0  0.548814  1.132211  1.323088  0.000114
1  0.544883  0.725987  0.792650  0.092339
2  0.437587  1.078033  1.309223  0.396767

In [44]:
ser_10 = Series([100, 200, 300])
ser_10

0    100
1    200
2    300
dtype: int64

In [45]:
df_10.sub(ser_10, axis=0)

            a           b           c           d
0  -99.451186  -98.867789  -98.676912  -99.999886
1 -199.455117 -199.274013 -199.207350 -199.907661
2 -299.562413 -298.921967 -298.690777 -299.603233

## 7. Function Application and Mapping

NumPy functions (element-wise array methods) operate on pandas objects:

In [46]:
df_11 = np.abs(df_11)
df_11

          a         b         c         d
0  0.000000  0.000000  0.000000  0.000000
1  0.003930  0.406224  0.530438  0.092224
2  0.111226  0.054178  0.013864  0.396653

Apply a function on 1D arrays to each column:

In [47]:
func_1 = lambda x: x.max() - x.min()
df_11.apply(func_1)

a    0.111226
b    0.406224
c    0.530438
d    0.396653
dtype: float64

Apply a function on 1D arrays to each row:

In [48]:
df_11.apply(func_1, axis=1)

0    0.000000
1    0.526508
2    0.382789
dtype: float64

Apply a function and return a DataFrame:

In [49]:
func_2 = lambda x: Series([x.min(), x.max()], index=['min', 'max'])
df_11.apply(func_2)

            a         b         c         d
min  0.000000  0.000000  0.000000  0.000000
max  0.111226  0.406224  0.530438  0.396653

Apply an element-wise Python function to a DataFrame:

In [93]:
func_3 = lambda x: '%.2f' %x
display(df_11)
df_11.applymap(func_3)

          a         b         c         d
0  0.000000  0.000000  0.000000  0.000000
1 -0.003930 -0.406224 -0.530438  0.092224
2 -0.111226 -0.054178 -0.013864  0.396653

       a      b      c     d
0   0.00   0.00   0.00  0.00
1  -0.00  -0.41  -0.53  0.09
2  -0.11  -0.05  -0.01  0.40

Apply an element-wise Python function to a Series:

In [51]:
df_11['a'].map(func_3)

0    0.00
1    0.00
2    0.11
Name: a, dtype: object

## 8. Sorting and Ranking

In [118]:
ser_4

fo    100.0
br    200.0
bz    300.0
qx      NaN
Name: foobarbazqux, dtype: float64

Sort a Series by its index:

In [119]:
ser_4.sort_index()

br    200.0
bz    300.0
fo    100.0
qx      NaN
Name: foobarbazqux, dtype: float64

Sort a Series by its values:

In [120]:
ser_4.sort_values()

fo    100.0
br    200.0
bz    300.0
qx      NaN
Name: foobarbazqux, dtype: float64

In [121]:
df_12 = DataFrame(np.arange(12).reshape((3, 4)),
                  index=['three', 'one', 'two'],
                  columns=['c', 'a', 'b', 'd'])
df_12

       c  a   b   d
three  0  1   2   3
one    4  5   6   7
two    8  9  10  11

Sort a DataFrame by its index:

In [56]:
df_12.sort_index()

       c  a   b   d
one    4  5   6   7
three  0  1   2   3
two    8  9  10  11

Sort a DataFrame by columns in descending order:

In [57]:
df_12.sort_index(axis=1, ascending=False)

        d  c   b  a
three   3  0   2  1
one     7  4   6  5
two    11  8  10  9

Sort a DataFrame's values by column:

In [58]:
df_12.sort_values(by=['d', 'c'])

       c  a   b   d
three  0  1   2   3
one    4  5   6   7
two    8  9  10  11

Ranking is similar to numpy.argsort except that ties are broken by assigning each group the mean rank:

In [59]:
ser_11 = Series([7, -5, 7, 4, 2, 0, 4, 7])
ser_11 = ser_11.sort_values()
ser_11

1   -5
5    0
4    2
3    4
6    4
0    7
2    7
7    7
dtype: int64

In [60]:
ser_11.rank()

1    1.0
5    2.0
4    3.0
3    4.5
6    4.5
0    7.0
2    7.0
7    7.0
dtype: float64

Rank a Series according to when they appear in the data:

In [61]:
ser_11.rank(method='first')

1    1.0
5    2.0
4    3.0
3    4.0
6    5.0
0    6.0
2    7.0
7    8.0
dtype: float64

Rank a Series in descending order, using the maximum rank for the group:

In [62]:
ser_11.rank(ascending=False, method='max')

1    8.0
5    7.0
4    6.0
3    5.0
6    5.0
0    3.0
2    3.0
7    3.0
dtype: float64

DataFrames can rank over rows or columns.

In [63]:
df_13 = DataFrame({'foo' : [7, -5, 7, 4, 2, 0, 4, 7],
                   'bar' : [-5, 4, 2, 0, 4, 7, 7, 8],
                   'baz' : [-1, 2, 3, 0, 5, 9, 9, 5]})
df_13

   foo  bar  baz
0    7   -5   -1
1   -5    4    2
2    7    2    3
3    4    0    0
4    2    4    5
5    0    7    9
6    4    7    9
7    7    8    5

Rank a DataFrame over rows:

In [64]:
df_13.rank()

   foo  bar  baz
0  7.0  1.0  1.0
1  1.0  4.5  3.0
2  7.0  3.0  4.0
3  4.5  2.0  2.0
4  3.0  4.5  5.5
5  2.0  6.5  7.5
6  4.5  6.5  7.5
7  7.0  8.0  5.5

Rank a DataFrame over columns:

In [65]:
df_13.rank(axis=1)

   foo  bar  baz
0  3.0  1.0  2.0
1  1.0  3.0  2.0
2  3.0  1.0  2.0
3  3.0  1.5  1.5
4  1.0  2.0  3.0
5  1.0  2.0  3.0
6  1.0  2.0  3.0
7  2.0  3.0  1.0

## 9. Axis Indexes with Duplicate Values

Labels do not have to be unique in Pandas:

In [66]:
ser_12 = Series(range(5), index=['foo', 'foo', 'bar', 'bar', 'baz'])
ser_12

foo    0
foo    1
bar    2
bar    3
baz    4
dtype: int64

In [67]:
ser_12.index.is_unique

False

Select Series elements:

In [68]:
ser_12['foo']

foo    0
foo    1
dtype: int64

Select DataFrame elements:

In [69]:
df_14 = DataFrame(np.random.randn(5, 4),
                  index=['foo', 'foo', 'bar', 'bar', 'baz'])
df_14

            0         1         2         3
foo -2.363469  1.135345 -1.017014  0.637362
foo -0.859907  1.772608 -1.110363  0.181214
bar  0.564345 -0.566510  0.729976  0.372994
bar  0.533811 -0.091973  1.913820  0.330797
baz  1.141943 -1.129595 -0.850052  0.960820

In [70]:
df_14.loc['bar']

            0         1         2         3
bar  0.564345 -0.566510  0.729976  0.372994
bar  0.533811 -0.091973  1.913820  0.330797

## 10. Summarizing and Computing Descriptive Statistics

Unlike NumPy arrays, Pandas descriptive statistics automatically exclude missing data.  NaN values are excluded unless the entire row or column is NA.

In [71]:
df_3

   year state  pop unempl
0  2012    VA  5.0    NaN
1  2013    VA  5.1    NaN
2  2014    VA  5.2    NaN
3  2014    MD  4.0    NaN
4  2015    MD  4.1    NaN

In [72]:
df_3.sum()

year           10068
state     VAVAVAMDMD
pop             23.4
unempl             0
dtype: object

Sum over the rows:

In [73]:
df_3.sum(axis=1)

0    2017.0
1    2018.1
2    2019.2
3    2018.0
4    2019.1
dtype: float64

Account for NaNs:

In [74]:
df_3.sum(axis=1, skipna=False)

0    2017.0
1    2018.1
2    2019.2
3    2018.0
4    2019.1
dtype: float64

## 11. Cleaning Data
* Replace
* Drop
* Concatenate

In [75]:
from pandas import Series, DataFrame
import pandas as pd

Setup a DataFrame:

In [76]:
data_1 = {'state' : ['VA', 'VA', 'VA', 'MD', 'MD'],
          'year' : [2012, 2013, 2014, 2014, 2015],
          'population' : [5.0, 5.1, 5.2, 4.0, 4.1]}
df_15 = DataFrame(data_1)
df_15

  state  year  population
0    VA  2012         5.0
1    VA  2013         5.1
2    VA  2014         5.2
3    MD  2014         4.0
4    MD  2015         4.1

### 11.1 Replace

Replace all occurrences of a string with another string, in place (no copy):

In [77]:
df_15.replace('VA', 'VIRGINIA', inplace=True)
df_15

      state  year  population
0  VIRGINIA  2012         5.0
1  VIRGINIA  2013         5.1
2  VIRGINIA  2014         5.2
3        MD  2014         4.0
4        MD  2015         4.1

In a specified column, replace all occurrences of a string with another string, in place (no copy):

In [78]:
df_15.replace({'state' : { 'MD' : 'MARYLAND' }}, inplace=True)
df_15

      state  year  population
0  VIRGINIA  2012         5.0
1  VIRGINIA  2013         5.1
2  VIRGINIA  2014         5.2
3  MARYLAND  2014         4.0
4  MARYLAND  2015         4.1

### 11.2 Drop

Drop the 'population' column and return a copy of the DataFrame:

In [79]:
df_2 = df_15.drop('population', axis=1)
df_2

      state  year
0  VIRGINIA  2012
1  VIRGINIA  2013
2  VIRGINIA  2014
3  MARYLAND  2014
4  MARYLAND  2015

### 11.3 Concatenate

Concatenate two DataFrames:

In [80]:
data_2 = {'state' : ['NY', 'NY', 'NY', 'FL', 'FL'],
          'year' : [2012, 2013, 2014, 2014, 2015],
          'pop' : [6.0, 6.1, 6.2, 3.0, 3.1]}
df_16 = DataFrame(data_2)
df_16

  state  year  pop
0    NY  2012  6.0
1    NY  2013  6.1
2    NY  2014  6.2
3    FL  2014  3.0
4    FL  2015  3.1

In [81]:
df_1

  state  year  pop
0    VA  2012  5.0
1    VA  2013  5.1
2    VA  2014  5.2
3    MD  2014  4.0
4    MD  2015  4.1

In [82]:
df_4 = pd.concat([df_1, df_16])
df_4

  state  year  pop
0    VA  2012  5.0
1    VA  2013  5.1
2    VA  2014  5.2
3    MD  2014  4.0
4    MD  2015  4.1
0    NY  2012  6.0
1    NY  2013  6.1
2    NY  2014  6.2
3    FL  2014  3.0
4    FL  2015  3.1

## 12. Input and Output
* Reading
* Writing

In [83]:
from pandas import Series, DataFrame
import pandas as pd

### 12.1 Reading

Read data from a CSV file into a DataFrame (use sep='\t' for TSV):

In [84]:
#install wget if you haven't 
#this is for online platform user only
#!pip install wget

In [85]:
import wget

link_to_data = 'https://raw.githubusercontent.com/gaoshangdeakin/SIT384/master/ozone.csv'
DataSet = wget.download(link_to_data)

#if you load the file locally, directly use the following command
df_1 = pd.read_csv("ozone.csv")

100% [................................................................................] 2901 / 2901

Get a summary of the DataFrame:

In [86]:
df_1.describe()

            Ozone     Solar.R        Wind        Temp       Month         Day
count  116.000000  146.000000  153.000000  153.000000  153.000000  153.000000
mean    42.129310  185.931507    9.957516   77.882353    6.993464   15.803922
std     32.987885   90.058422    3.523001    9.465270    1.416522    8.864520
min      1.000000    7.000000    1.700000   56.000000    5.000000    1.000000
25%     18.000000  115.750000    7.400000   72.000000    6.000000    8.000000
50%     31.500000  205.000000    9.700000   79.000000    7.000000   16.000000
75%     63.250000  258.750000   11.500000   85.000000    8.000000   23.000000
max    168.000000  334.000000   20.700000   97.000000    9.000000   31.000000

List the first five rows of the DataFrame:

In [87]:
df_1.head()

   Ozone  Solar.R  Wind  Temp  Month  Day
0   41.0    190.0   7.4    67      5    1
1   36.0    118.0   8.0    72      5    2
2   12.0    149.0  12.6    74      5    3
3   18.0    313.0  11.5    62      5    4
4    NaN      NaN  14.3    56      5    5

### 12.2 Writing

Create a copy of the CSV file, encoded in UTF-8 and hiding the index and header labels:

In [88]:
df_1.to_csv('ozone_copy.csv', 
            encoding='utf-8', 
            index=False, 
            header=False)

View the data directory:

In [89]:
#for linux or mac user
#!ls -l ./

#for windows user
!dir .\

 Volume in drive C is Windows
 Volume Serial Number is C2AA-088A

 Directory of C:\tmp\units\2022\SIT384-2022-1\practicals\jupyter-notebook

25/03/2022  09:42 AM    <DIR>          .
25/03/2022  09:42 AM    <DIR>          ..
14/05/2021  06:01 PM           215,714 .ipynb
24/03/2022  10:03 AM    <DIR>          .ipynb_checkpoints
29/03/2020  12:00 PM             1,167 Auto (1).csv
03/04/2020  05:10 PM             1,167 Auto (2).csv
03/04/2020  05:27 PM             1,167 Auto (3).csv
03/04/2020  05:34 PM             1,167 Auto (4).csv
04/04/2020  05:26 PM             1,167 Auto (5).csv
29/03/2020  09:27 AM             1,167 Auto.csv
29/03/2020  12:00 PM            65,403 body.dat (1).txt
29/03/2020  09:27 AM            65,403 body.dat.txt
29/03/2020  12:00 PM               356 constitution (1).txt
29/03/2020  09:27 AM               356 constitution.txt
19/04/2020  03:55 PM           111,480 COVID-19.ipynb
23/03/2021  08:03 PM                70 csv_data1 (1).csv
24/03/2022  10:20 AM                70 csv_data1 (2).csv
24/03/2022  10:20 AM                70 csv_data1 (3).csv
23/03/2021  08:03 PM                70 csv_data1.csv
24/03/2022  10:20 AM               606 csv_data2.csv
24/03/2022  10:03 AM    <DIR>          data
29/03/2020  12:00 PM             6,397 DraftLottery (1).txt
29/03/2020  09:27 AM             6,397 DraftLottery.txt
29/03/2020  12:00 PM            37,758 fat.dat (1).txt
29/03/2020  09:27 AM            37,758 fat.dat.txt
24/03/2022  10:03 AM    <DIR>          fig_code
03/04/2020  05:34 PM            20,865 housing_300 (1).csv
04/04/2020  05:26 PM            20,865 housing_300 (2).csv
03/04/2020  05:27 PM            20,865 housing_300.csv
24/03/2022  10:03 AM    <DIR>          images
24/03/2022  10:20 AM               406 json_data1 (1).json
23/03/2021  08:03 PM               406 json_data1.json
23/03/2021  08:03 PM                92 json_data_now.json
23/03/2020  06:54 PM             2,901 ozone (1).csv
16/03/2021  09:12 AM             2,901 ozone (2).csv
25/03/2022  09:42 AM             2,901 ozone (3).csv
22/03/2020  12:59 PM             2,901 ozone.csv
25/03/2022  09:42 AM             3,477 ozone_copy.csv
25/03/2021  03:39 PM            12,023 P03Saved.pdf
20/05/2020  11:47 AM            57,092 practical5-review.ipynb
14/05/2019  12:10 AM                38 README.md
11/03/2022  11:17 AM    <DIR>          SIT384-Jupyter-master
19/04/2020  06:48 PM           701,496 SIT384-Jupyter-week6.zip
04/03/2022  09:26 AM         2,346,117 SIT384P01A-Python.ipynb
08/03/2020  12:25 PM         1,288,057 SIT384P01A-Python.zip
13/03/2022  03:56 PM    <DIR>          SIT384P02A-Python2
08/05/2021  08:52 PM            29,412 SIT384P02A-Python2.ipynb
15/03/2020  02:36 PM           532,358 SIT384P02A-Python2.zip
24/03/2022  02:34 PM            72,832 SIT384P03A-Python packages and data.ipynb
25/03/2022  09:41 AM           201,849 SIT384P03B-Pandas.ipynb
09/05/2021  11:45 AM         1,086,103 SIT384P04A-Matplotlib Plot.ipynb
16/04/2021  09:11 PM           621,128 SIT384P05A-Supervised Learning-linear regression.ipynb
19/05/2021  12:50 PM           781,798 SIT384P06A-Supervised Learning2.ipynb
22/04/2021  08:20 PM           211,597 SIT384P06B-Supervised Learning In-Depth- Support Vector Machines.ipynb
30/04/2021  08:39 PM           446,043 SIT384P07A-Unsupervised Learning.ipynb
26/05/2021  10:29 AM           743,832 SIT384P08A-Feature Selection and Dimensionality Reduction.ipynb
26/05/2021  03:38 PM           215,700 SIT384P09A-validation and model selection.ipynb
18/05/2021  10:59 PM           309,294 SIT384P10A-Case study.ipynb
24/03/2022  10:03 AM    <DIR>          sklearn_pycon2015-master
17/04/2020  11:17 AM         3,821,394 sklearn_pycon2015-master.zip
24/03/2022  10:03 AM    <DIR>          students
06/05/2020  08:03 PM           518,872 submission.csv
24/03/2022  10:20 AM                16 txt_data1 (1).txt
23/03/2021  08:03 PM                16 txt_data1.txt
24/03/2022  10:20 AM               130 txt_data2.txt
08/05/2020  03:33 PM                72 Untitled.ipynb
09/03/2021  08:26 PM               555 Untitled1.ipynb
04/03/2022  10:03 AM               799 Untitled2.ipynb
              58 File(s)     14,632,113 bytes
              10 Dir(s)  755,168,735,232 bytes free